---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.WinderRunWidthOrMinWidthOrTooShortFailure
source: html/37d3de3f-f675-1425-1189-27d3991579b6.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.WinderRunWidthOrMinWidthOrTooShortFailure Property

The parameter runwidth is too great or the parameter min width at inside boundary is too great, or one leg of winder run is too short.

## Syntax (C#)
```csharp
public static FailureDefinitionId WinderRunWidthOrMinWidthOrTooShortFailure { get; }
```